Revit 2026 API

# ScheduleFilterSetValue(ElementId) Method

---

Set the filter value to an ElementId.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetValue(
	ElementId id
)
```
```vb
Public Sub SetValue (
	id As ElementId
)
```
```cpp
public:
void SetValue(
	ElementId^ id
)
```
```fsharp
member SetValue :
        id : ElementId -> unit
```

#### Parameters

id ElementId
     The filter value.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ScheduleFilter Class

SetValue Overload

Autodesk.Revit.DB Namespace